{
  "backend/main.mo": "Minimal Motoko backend actor with no methods or state defined yet.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (landing page, auth pages, dashboards, quiz flows, etc.) to their source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "JSON map of frontend page file paths to short descriptions summarizing each page's UI components and notable bug fixes applied.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "HTML shell for the React app titled 'AI Quiz Platform' that mounts the app into a root div and loads the main TSX entry point.",
  "frontend/src/App.tsx": "Root application component that defines the full TanStack Router route tree, including public routes (landing, login, signup, pricing) and authenticated child routes wrapped in AuthenticatedLayout.",
  "frontend/src/components/layout/AuthenticatedLayout.tsx": "Layout wrapper for authenticated pages that renders the Sidebar, TopNavbar, and an Outlet, with persistent dark mode toggling via localStorage.",
  "frontend/src/components/layout/LandingHeader.tsx": "Fixed top navigation header for the landing page with logo, desktop nav links, login/signup CTA buttons, and a responsive mobile menu.",
  "frontend/src/components/layout/Sidebar.tsx": "Collapsible sidebar navigation component with role-aware nav items (student vs. teacher/admin), active route highlighting, and a mobile overlay.",
  "frontend/src/components/layout/TopNavbar.tsx": "Sticky top navigation bar with mobile menu toggle, XP display, theme toggle, notification bell, and a user avatar dropdown menu with profile/settings/sign-out links.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file that exports nothing; reserved for future backend query hooks while the app uses mock data.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/components/utilities, OKLCH-based CSS custom properties for light and dark themes, and utility classes for gradients and glass-card effects.",
  "frontend/src/lib/mockData.ts": "Exports static mock data arrays and objects for a user profile, quizzes, quiz questions, achievements, leaderboard, and activity history used throughout the app.",
  "frontend/src/lib/utils.ts": "Utility functions for merging Tailwind class names, mapping difficulty levels to color classes, converting numeric scores to letter grades, and formatting date strings.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/Achievements.tsx": "Achievements page displaying a user's level progress, a calendar activity heatmap, streak stats, and a filterable grid of achievement badges with locked/unlocked states.",
  "frontend/src/pages/Analytics.tsx": "Analytics dashboard page displaying KPI cards, date range filtering, and charts (line, bar, pie) for performance metrics using Recharts and mock data. Includes a student performance table and a CSV export placeholder.",
  "frontend/src/pages/CreateQuiz.tsx": "Multi-step quiz creation page with steps for quiz details, adding/editing questions manually or from a question bank, and a review/publish step. Supports MCQ, True/False, and fill-in-the-blank question types.",
  "frontend/src/pages/GenerateQuiz.tsx": "AI-powered quiz generation page where users input a topic, select difficulty, question count, language, and question types, then trigger a mock async generation that displays preview questions.",
  "frontend/src/pages/Landing.tsx": "Public landing page featuring a hero section, interactive demo quiz, animated count-up stats section, and feature highlights with calls-to-action for sign-up and navigation.",
  "frontend/src/pages/Leaderboard.tsx": "Leaderboard page showing a top-3 podium, a live countdown to the next weekly reset, and tabbed tables for global, friends, and weekly challenge rankings using mock data.",
  "frontend/src/pages/Login.tsx": "Renders a login page with email/password form and Google sign-in option, navigating to the dashboard on submit after a simulated async delay.",
  "frontend/src/pages/Pricing.tsx": "Displays a pricing page with Free, Pro, and Enterprise plan cards, a monthly/annual billing toggle, a feature comparison table, and an FAQ accordion.",
  "frontend/src/pages/Profile.tsx": "Renders a user profile page with editable account info, avatar upload, stats display, notification preferences, recent activity feed, and a danger zone for account deletion.",
  "frontend/src/pages/QuestionBank.tsx": "Displays a searchable, filterable table of quiz questions with bulk/individual delete actions, difficulty distribution bar chart, and topic/type/difficulty filter selects.",
  "frontend/src/pages/QuizLibrary.tsx": "Shows a browsable quiz library with a featured carousel, search input, category tabs, and a difficulty filter sidebar, navigating to individual quizzes on play.",
  "frontend/src/pages/QuizPlay.tsx": "Interactive quiz-taking page with a countdown timer, answer selection with correct/incorrect feedback, power-ups (50/50, skip, extra time), flagging, and navigation between questions using mock data.",
  "frontend/src/pages/Results.tsx": "Quiz results page displaying an animated score, grade, stat breakdown, topic analysis bars, a score trend line chart, and recommended quizzes, with confetti shown for high scores.",
  "frontend/src/pages/Signup.tsx": "Signup form page with role selection (student, teacher, admin), name/email/password inputs, password visibility toggle, and terms agreement, redirecting to the appropriate dashboard on submit.",
  "frontend/src/pages/StudentDashboard.tsx": "Student dashboard showing performance stats, a weekly activity area chart, a continue-last-quiz card, recent quiz history, a leaderboard, and recommended quizzes using mock data.",
  "frontend/src/pages/TeacherDashboard.tsx": "Teacher dashboard with KPI cards, a quiz management table with delete support, bar/line charts for topic scores and weekly performance, and an activity feed, all using mock data.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom colors (using oklch), fonts, shadows, gradients, border radii, and keyframe animations. Includes plugins for typography, container queries, and animate.",
  "project_state.json": "Project state snapshot describing the AI Quiz Platform's architecture, tech stack, existing features across 15+ pages, known issues, and image requirements. Serves as a build planning reference tracking feature implementations and design system conventions."
}